Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Задано явно.
en: Explicitly set.

source: Задать вручную.
en: Custom.

source: Задать максимум — при активном флаге указывается значение от 1 000 и выше.
en: Set maximum value: when the checkbox is active, the value from 1,000 and higher is specified.

source: Задать максимум — при активном флаге указывается значение от 1 111 и выше.
en: Set maximum: when the checkbox is active, the value from 1 111 and higher is specified.

source: Задать минимум — при активном флаге указывается значение от 0 до 9 999.
en: Set minimum value: when the checkbox is active, the value from 0 to 9,999 is specified.

source: Задать произвольную структуру выходного набора — его перечень и параметры полей/переменных;
en: Set the random structure of the output data set: its list and parameters of fields/variables.

source: Задать собственное количество интервалов (в случае, если поле непрерывного типа);
en: Set the own bin count (when the field refers to the continuous type);

source: Задать собственное максимальное значение поля;
en: Set the own maximum field value;

source: Задать собственное минимальное значение поля;
en: Set the own minimum field value;

source: Задача состоит в получении такого разбиения всего множества транзакций, чтобы похожие транзакции оказались в одном кластере, а отличающиеся друг от друга — в разных кластерах.
en: It is required to provide clustering of the whole set of transactions to place all similar transactions to one cluster, whereas the transactions that differ from each other must be placed into different clusters.

source: Задача тиражирования знаний заключается в предоставлении возможности сотрудникам, не разбирающимся в методиках анализа и способа получения того или иного результата, получать ответ на аналитические запросы на основе моделей, подготовленных экспертом.
en: The challenge of knowledge distribution is to give an opportunity to the employees who are not aware of analysis methods and procedure of achievement of a particular result, to receive a response to the analytical requests based on the models provided by the expert.

source: Задают параметры авторизации пользователя при его регистрации в системе веб-сервиса.
en: When registering in the web service system, parameters of user authorization are set.

source: Задаются параметры подключения, запроса и ответа REST-сервиса.
en: Parameters of the REST service connection, request and response are set.

source: Задаются следующие настройки:
en: The following settings are set:

source: Задаются условия, по которым определяются частые предметные наборы — наборы элементов, наиболее часто встречающиеся в транзакциях.
en: It is required to determine conditions according to which frequent object itemsets are defined, namely, the itemsets that are the most frequently occurring in transactions.

source: Задний план.
en: Back

source: Зажать клавишу CTRL и выделить их по одному кликами левой кнопки мыши; повторное нажатие по полю снимает выделение;
en: Press CTRL button and select them with one click of the left mouse button. The repeated field pressing deselects the field.

source: Закрепление
en: Freezing

source: Закрытый
en: Private

source: Закрытый (доступен только внутри текущего Модуля);
en: Private (available only in the current Module);

source: Закрыть Быстрый просмотр можно нажатием на кнопку X или Закрыть.
en: It is possible to close Quick view by pressing X or Close button.

source: Закрыть Предпросмотр узла JavaScript можно только кнопкой X, в узле Импорт из базы данных также доступна кнопка Закрыть.
en: It is possible to close Preview of JavaScript node using only X button, in Import from database node Close button is also available.

source: Замена не попавших в Таблицу замен
en: Substitution of the Values not Included into the Replacement Table

source: Замена по регулярному выражению
en: Replacement by Regular Expression

source: Замена по регулярному выражению применима только к данным строкового типа.
en: Replacement by regular expression is applied only to the data of the string type.

source: Замена по точному совпадению
en: Replacement by Exact Match

source: Замена узла подключения отнаследованным узлом
en: Replacement of the connection node with the inherited node

source: Заменять заданным значением
en: Replace with set value

source: Заменять значением "Не задано" — выявленные пропуски заменяются значением "Не задано".
en: Replace with "Not defined": replace detected null data with "Not defined".

source: Заменять значением «Не задано»
en: Replace with "Not defined"

source: Заменять медианой
en: Replace with median

source: Заменять медианой — выявленные пропуски заменяются медианой, вычисленной по столбцу;
en: Replace with median: replace detected null data with the median calculated for the column.

source: Заменять наиболее вероятным
en: Replace with most frequent

source: Заменять наиболее вероятным — выявленные пропуски заменяются наиболее вероятным значением по столбцу, замена производится на среднее значение из наиболее вероятного интервала, число интервалов варьируется в зависимости от объема выборки — чем она больше, тем больше интервалов;
en: Replace with most frequent: replace null data with the most frequent column value. Replacement is performed using the average value from the most frequent histogram bin. The bin count varies according to the sample size: the larger the sample size, the higher number of bins.

source: Заменять остальное:На регулярное выражение
en: Replace other:With regular expression

source: Заменять случайными значениями
en: Replace with random values

source: Заменять случайными значениями — выявленные пропуски заменяются случайными значениями, которые формируются из диапазона от наименьшего до наибольшего значения столбца;
en: Replace with random values: replace detected null data with the random values that are formed from the range from the lowest to the highest column value.

source: Заменять средним
en: Replace with average

source: Заменять средним — выявленные пропуски заменяются средним значением столбца;
en: Replace with average: replace detected null data with the average column value.

source: Заменять\_все - флаг замены всех вхождений Старого шаблона на Новый шаблон.
en: Replace\_all - flag of replacement of all occurrences of the Old template with the New template.

source: Занятых в экономике (тыс.
en: People employed in the economic sphere (thous.

source: Западноевропейская (1252);
en: West European (1252);

source: Записи в списках Входное дерево и Выходное дерево можно отфильтровать с помощью команды Фильтрация на соответствующей панели инструментов.
en: It is possible to filter records in the Input Tree and Output Tree lists using Filter command of corresponding toolbar.

source: Записи второй таблицы, которые не вошли во внутреннее соединение на шаге 1.
en: Records of the second table that were not included into the inner join during step 1.

source: Записи первой таблицы, которые не вошли во внутреннее соединение на шаге 1.
en: Records of the first table that were not included into the inner join during step 1.

source: Записи с <null> в агрегации не участвуют вовсе.| | Максимум|•|•|•|•|•|•|Выводит наибольшее значение по столбцу.
en: Records with <null> are not included into the aggregation.| | Maximum|•|•|•|•|•|•|It shows the maximum value by column.

source: Запрещено менять способ Аутентификации самому себе, так как в этом случае пользователь может стать недоступным, а он мог быть единственным администратором.
en: It is forbidden to change the Authentification method for oneself. In this case, a user can become unavailable, whereas he can be the only administrator.

source: Запуск Пакета с параметром /Node.
en: Launch of the Package with /Node parameter.

source: Запуск Пакета с параметром /Teach или без него;
en: Launch of the Package with /Teach parameter or without it;

source: Запуск пакета в режиме «Обучение».
en: Package launch in the «Training» mode.

source: Запятая;
en: Comma

source: Затем в таблице под списком выбирается используемый для авторизации сертификат.
en: Then it is required to select the certificate used for authorization in the table below the list.

source: Затем на $$k-1$$, т.е. на 4-х блоках, производится обучение модели, а 5-й блок используется для тестирования.
en: Then to $$k-1$$, namely, the model is trained on 4 blocks, and the 5th block is used for testing.

source: Затем на место удаленной подстроки вставляется Вставляемая\_строка.
en: Then instead of the deleted substring, the Inserted\_string is inserted.

source: Затирка
en: Grout

source: Защищенный
en: Secure

source: Здесь '%Media%' не является макроподстановкой, поэтому замена на значение переменной произведена не будет.
en: In this case, '%Media%' is not a macro substitution, that's why no replacement with the variable value will take place.

source: Здесь задается наличие необходимых портов.
en: It enables to provide the presence of the required ports.

source: Здесь задаются каталоги для хранения данных и файлов:
en: The directories used to save data and files are set here:

source: Здесь задаются настройки для подключения к LDAP серверу:
en: The settings used for connection to the LDAP server are set here:

source: Здесь задаются:
en: The following data is set below:

source: Здесь создаются порты.
en: Ports are created here.

source: Знак
en: Sign

source: Значение
en: Value

source: Значение - выражение, величина которого сравнивается с аргументом Выражение.
en: Value - the expression value of which is compared with the Expression argument.

source: Значение - значение искомого элемента;
en: Value - value of the target element.

source: Значение - значение косинуса, для которого необходимо найти угол.
en: Value - the cosine value for which it is required to determine the angle.

source: Значение - значение синуса, для которого необходимо найти угол.
en: Value - the sinus value for which it is required to determine the angle.

source: Значение - значение тангенса, для которого необходимо найти угол.
en: Value - the tangent value for which it is required to determine the angle.

source: Значение 1026598E+8 рассчитано на основе максимального значения Периода сглаживания.
en: 1026598E+8 value was calculated on the basis of the maximum values of the Smoothing Period.

source: Значение X — выводится координата столбца по оси X.
en: X value: the column coordinate along the X axis is displayed.

source: Значение вещественного типа от 0 до 1.
en: It is a real value from 0 to 1.

source: Значение выбранного показателя для текущей модели
en: Value of the selected indicator for the current model

source: Значение выражения в каждой строке набора данных будет вычислено по формуле или JavaScript коду.
en: The expression value in each data set row will be calculated using the formula or the JavaScript code.

source: Значение выражения в каждой строке набора данных будет вычислено по формуле, заданной в области кода выражения.
en: The expression value in each data set row will be calculated using the formula set in the expression code area.

source: Значение исходных данных
en: The source data value

source: Значение каждого критерия можно задать в специальном поле справа от соответствующей ему радиокнопки.
en: It is possible to set the value of each criterion in the special field to the right of the radio button corresponding to it.

source: Значение каждой ячейки можно скопировать в текстовом формате, нажав комбинацию клавиш Ctrl+C.
en: Value of each cell can be copied in the text format by pressing Ctrl+C keys combination.

source: Значение лифта, равное или меньшее 1, говорит об отсутствии или отрицательной связи.
en: The lift value equal or less than 1 shows absence or negative connection.

source: Значение логического типа.
en: Boolean value.

source: Значение параметра Диапазон можно задать при помощи выделения мышью ячеек таблицы.
en: Value of the Range parameter can be set by selecting the table cells with the mouse.

source: Значение параметра, установленное по умолчанию, при необходимости следует скорректировать в соответствии с экспортируемыми данными.
en: It is required to adjust the parameter value set by default according to the exported data, if relevant.

source: Значение переменной USERNAME в ней будет равно "Иванов".
en: The value of the USERNAME variable in it will be "Ivanov".

source: Значение по умолчанию
en: Default value

source: Значение по умолчанию - 39.7 (рассчитано на основе значения по умолчанию Labmba, равного 1600).
en: Default value - 39.7 (it is calculated on the basis of the default Labmba value that is equal to 1600).

source: Значение по умолчанию - числовое выражение, результат которого возвращается, если ни одно ЗначениеN не равно Выражению (по умолчанию 0).
en: Default value - the numeric expression the result of which is returned if none of the ValuesN is equal to the Expression (by default 0).

source: Значение по умолчанию — Лист 1.
en: Default value — Sheet 1.

source: Значение столбца — в качестве идентификаторов будут использованы значения выбранного столбца входной таблицы.
en: The column value: values of the selected column of the input table will be used as identifiers.

source: Значение целого типа, выбираемое согласно списку уникальных значений.
en: The integer value selected according to the list of unique values.

source: Значение этого параметра выбирается из списка:
en: The value of this parameter is selected from the list:

source: Значение — представлено собственно значение, отображаемое элементом диаграммы.
en: Value: the value displayed by the chart element is represented.

source: Значение, равное 0, обеспечивает такое разбиение на классы, которое максимизирует информационный индекс.
en: The value that is equal to 0 provides for such partitioning into classes that maximizes the information value.

source: Значение.
en: Value.

source: Значение1,
en: Value1.

source: Значение2 - выражения любых типов
en: Value2 - expressions of any types.

source: Значение2 - числовые выражения или выражения типа Дата/время
en: Value2 - numeric expressions or expressions of the Date/time type.

source: ЗначениеN - выражение, величина которого сравнивается с аргументом Выражение.
en: ValueN - the expression value of which is compared with the Expression argument.

source: ЗначениеN - числовое выражение, величина которого сравнивается с аргументом Выражение.
en: ValueN - the numeric expression value of which is compared with the Expression argument.

source: Значение\_по\_умолчанию - выражение строкового типа, результат которого возвращается, если Выражение не равно ни одному из ЗначениеN (если не указано, то равно "").
en: Default\_value - the expression of the string type the result of which is returned if the Expression is equal to none of the ValuesN (if it is not stated then it is equal to "").

source: Значение\_по\_умолчанию - выражение числового типа или типа Дата/Время, результат которого возвращается, если Выражение не равно ни одному из ЗначениеN (если не указано, то равно 0).
en: Default\_value - the expression of the numeric or Date/Time type the result of which is returned, if the Expression is equal to none of the ValuesN (if it is not stated then it is equal to 0).

source: Значение\_по\_умолчанию - выражение, результат которого возвращается, если Выражение не равно ни одному из Значений (если не указано, то равно Null).
en: Default\_value - the expression, the result of which is returned if the Expression is equal to none of the Values (if it is not stated then it is equal to Null).

source: Значение\_по\_умолчанию - необязательный параметр, строковое или числовое выражение, значение которого возвращается, если Выражение равно Null.
en: Default\_value - optional parameter, string or numeric expression value of which is returned if the Expression is equal to Null.

source: Значения
en: Values

source: Значения не попавшие в Таблицу замен обрабатываются согласно настройке параметра Заменять остальное.
en: The values not included into the Replacement table are processed according to the configured parameter - Replace other.

source: Значения не попавшие, ни в Таблицу замен, ни в Допустимые интервалы, обрабатываются согласно настройке параметра Заменять остальное.
en: The values included neither into the Replacement table, nor into Allowable intervals, are processed according to the configured parameter - Replace other.

source: Значения переменных могут использоваться в вычислениях, например, в узлах Калькулятор, Условие и прочие.
en: The variables values can be used in calculations, for example, in the following nodes: Calculator, Condition, etc.

source: Значения переменных можно расположить в строках, либо в столбцах результирующей таблицы.
en: It is possible to place the values of variables in the strings or columns of the resulting table.

source: Значения полей таблицы замен
en: Values of the replacement table fields

source: Значения строк таблицы замен
en: Values of the replacement table rows

source: Значения этих полей станут заголовками столбцов.
en: The values of these fields will be the columns headers.

source: Значения ячеек другой группы полей образуют колонки сводной таблицы, задавая их заголовки;
en: The values of cells of the other fields groups form the columns of the pivot table defining their headers.

source: Значения ячеек столбца "Входные" редактируются.
en: The "Input" column cells values are edited.

source: Значимыми являются следующие факторы:
en: The following factors are important:

source: И настройки кросс-таблицы не изменились, то результирующий набор будет следующим
en: And the cross table settings are unchanged, the resulting data set will be as follows:

source: И параметром Разделитель частей меток полей: .
en: And the following parameter: Field caption parts separator: .

source: И строку для ввода нового значения не попавших в Таблицу замен записей.
en: And the row for input of the new value of the records not included into the Replacement table.

source: И точность равная 5.
en: And precision is equal to 5.

source: Игнорировать\_регистр - флаг чувствительности к регистру при замене.
en: Ignore\_case - flag of case sensitivity in the case of replacement.

source: Идентификатор внешнего разбиения — появляется если выбрано назначение "Входное (внешнее разбиение)", где разбиение берется из таблицы, а не рассчитывается алгоритмом на основе текущих данных (см.
en: External binning identifier: it appears if "Input (external binning)" usage type is selected, when the binning is taken from the table, and it is not calculated using the algorithm based on the current data (refer to

source: Идентификатор задается пользователем
en: The identifier is set by a user

source: Идентификатор интервалов
en: Bins identifier

source: Идентификатор пакета
en: Package identifier

source: Идентификатор поля — показывает, из какого именно документа была извлечена конкретная строка.
en: The field identifier enables to identify from which document a particular string has been extracted.

source: Идентификатор поля — показывает, какому документу соответствует запись в таблице логов;
en: The field identifier enables to identify the document with which a record is connected in the log table.

source: Идентификатор текущей сессии на сервере Loginom
en: Identifier of the current session on the Loginom server

source: Идентификатор транзакции
en: Transaction identifier

source: Идентификаторы и элементы транзакций могут быть представлены только дискретными данными.
en: Identifiers and transaction items can be represented only by discrete data.

source: Идентификация запроса.
en: Request Identification.

source: Из Производных компонентов создаются производные узлы — наследники базового узла.
en: From the Derived Components the derived nodes are created. They are descendants of the base node.

source: Из выпадающего списка необходимо выбрать поле, по которому таблицы будут связываться.
en: It is required to select the field from the drop-down list by which the tables will be connected.

source: Из данных каждого поля таблицы формируется переменная.
en: A variable is generated from the data of each table field.

source: Из значений полей сформируются строки в кросс-таблице.
en: The cross table rows will be generated from the fields values.

source: Из модулей CommonJS можно загружать только модули CommonJS.
en: Only the CommonJS modules can be loaded from the CommonJS modules.

source: Из модуля доступна глобальная переменная __filename, хранящая абсолютный путь к модулю внутри файлового хранилища.
en: The global __filename variable that keeps the absolute path to the module inside the file storage is available by the module.

source: Из списка выбирается одно из хранилищ сертификатов имеющихся в системе.
en: One of the certificate stores available in the system is selected from the list.

source: Из списка выбирается одно из хранилищ сертификатов, имеющихся в системе.
en: One of the certificate stores available in the system is selected from the list.

source: Из списка выходных полей/переменных удаляются все необязательные поля/переменные, которые не связаны с входными.
en: All optional fields/variables that are not linked with the input ones are deleted from the list of the output fields/variables.

source: Из этого можно сделать вывод, что "Томатная паста" является сопутствующим товаром, а "Макароны" — заместителем товара "Спагетти".
en: Thus, it is possible to draw a conclusion that the "Tomato paste" item of goods is a complement product, whereas the "Pasta" item of goods is a replacement product.

source: Извлекает Ном.Вхожд-й Email-адрес из строки Вх.Строка.
en: Extracts OccurencesNumber Email-address from the InputString string.

source: Изменение видимости
en: Visibility change

source: Изменение имен полей/переменных;
en: Change of the fields/variables names;

source: Изменение имени
en: Change name

source: Изменение меток полей/переменных;
en: Change of the fields/variables captions;

source: Изменение поля
en: Field change

source: Изменение структуры данных в выходном порту.
en: Change of the data structure in the output port.

source: Изменение структуры данных во входном порту и передача их на обработку.
en: Change of the data structure in the input port and its transfer for processing.

source: Изменение типа
en: Change type

source: Изменение типа данных
en: Change data type

source: Изменения в области кода сохраняются при выходе из нее.
en: Changes in the code area are saved on exit.

source: Изменения, производимые в дальнейшем с таблицей замен или файлом, не отражаются друг на друге.
en: Further changes of the replacement table or file will not have an impact on each other.

source: Измененные поля выделяются в мастере настройки порта жирным шрифтом и фиксируются как постоянные, ожидаемые портом.
en: If the changed fields are highlighted in bold in the wizard, and they are reflected as the constant ones expected by the port.

source: Измерения, которые не были перенесены в строки, столбцы или область фильтрации, в списке доступны не будут.
en: The dimensions that have not been tranferred to rows, columns or filtration area will not be available in the list.

source: Изначально входных и выходных портов нет, они создаются пользователем в мастере настройки.
en: Primarily, there are no input and output ports, they are created by a user in the wizard.

source: Изначально на правом поле доступен только один корневой каталог — Root.
en: Primarily, only one root directory is available in the right field - Root.

source: Изящная.
en: Elegant.

source: Иконка
en: Icon

source: Или заданная сервером опция shared-memory-base-name (не должна являться корректным номером порта).
en: Or shared-memory-base-name option set by the server (it mustn't be the correct port number).
